# GetPointCloudOverrides Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
View..::..GetPointCloudOverrides Method
View Class See Also
---
Returns point cloud overrides object for the view.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public PointCloudOverrides GetPointCloudOverrides()
```

Visual Basic
---
```text
Public Function GetPointCloudOverrides As PointCloudOverrides
```

Visual C++
---
```text
public:
PointCloudOverrides^ GetPointCloudOverrides()
```

# ### Return Value
Point cloud overrides for the view
# See Also
View Class
Autodesk.Revit.DB Namespace